#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = [
    'Папа',
    'Мама',
    'Сын',
    'Дочь',
    'Дедушка',
    'Бабушка'
]


# список списков приблизителного роста членов вашей семьи
my_family_height = [
    # ['имя', рост],
    ['Папа', 1.83],
    ['Мама', 1.75],
    ['Сын', 1.25],
    ['Дочь', 1.12],
    ['Дедушка', 1.74],
    ['Бабушка', 1.65]
]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см
name = 'Папа'
fathers_height = my_family_height[name, [0]]

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
# TODO здесь ваш код
